CREATE TABLE [Employee]
(
  [Id]             INT NOT NULL ,
  [Name]           NVARCHAR(50) NOT NULL ,
  [DateOfBirth]    DATE NOT NULL ,
  [Male]           TINYINT NOT NULL ,
  [RestDay]        INT NOT NULL  ,
	PRIMARY KEY (Id)
);

CREATE TABLE [Lesson]
(
  [Id]                  INT NOT NULL ,
  [Name]                NVARCHAR(50) NOT NULL ,
  [DayOfWeek]		   INT NOT NULL ,
  [NumberOfLesson]	   INT NOT NULL ,
  [EmployeeId]		   INT NOT NULL ,
	PRIMARY KEY (Id),
	FOREIGN KEY (EmployeeId) REFERENCES [Employee](Id)
);

INSERT INTO [Employee]
VALUES
	(1, 'Антонина', '1967-09-25', 0, 1),
  (2, 'Надежда', '1978-12-03', 0, 2),
  (3, 'Александр', '1969-02-21', 1, 5)

INSERT INTO [Lesson]
VALUES
  (1, 'Алгебра', 2, 1, 1),
	(2, 'Алгебра', 2, 2, 1),
	(3, 'Математический анализ', 2, 3, 1),
	(4, 'Геометрия', 3, 1, 1),
	(5, 'Геометрия', 3, 2, 1),
	(6, 'Геометрия', 4, 1, 1),
	(7, 'Математический анализ', 5, 1, 1),
	(8, 'Математический анализ', 5, 2, 1),
	(9, 'Математический анализ', 5, 3, 1),

	(10, 'Программирование', 1, 1, 2),
	(11, 'Программирование', 1, 2, 2),
	(12, 'Программирование', 1, 3, 2),
	(13, 'Программирование', 3, 1, 2),
	(14, 'Программирование', 3, 1, 2),
	(15, 'Программирование', 4, 2, 2),
	(16, 'Программирование', 4, 3, 2),
	(17, 'Программирование', 5, 1, 2),
	(18, 'Программирование', 5, 2, 2),

	(19, 'Базы данных', 1, 1, 3),
	(20, 'Базы данных', 1, 2, 3),
	(21, 'Базы данных', 2, 3, 3),
	(22, 'Базы данных', 3, 1, 3),
	(23, 'Базы данных', 3, 2, 3),
	(24, 'Базы данных', 3, 3, 3),
	(25, 'Базы данных', 4, 2, 3)